///----------------------------------------------------------------------------|
/// ИИ.
///     Всё что нужно сделать это ПРИНЯТЬ РЕШЕНИЕ,
///     в какую координату поставить фишку.
///----------------------------------------------------------------------------:

///------------------------------------|
/// ...                                |
///------------------------------------:
const wchar_t* name = L"АфторРэнд";

struct  AI
{

    ///------------|
    /// Ваша фишка.|
    ///------------:
    char     FISHKA = 'Y';

    Plot step(const Field& field) const
    {
        //l(FISHKA)
        //std::cin.get();

        /// TODO ...
        ///--------------------...
        /// пример простейшего решения ...
        ///--------------------...
        while(true)
        {
            Plot p;
                 p.x = rrand(0, field.W);
                 p.y = rrand(0, field.H);

            if(field.verification(p)) return p;
        }

        return {size_t(-1), 0};
    }

    ///--------------------...
    /// пример обхода поля ...
    ///--------------------...
    /*
    void debug(const Field& field) const
    {
        for    (size_t h = 0; h < field.H; ++ h)
        {   for(size_t w = 0; w < field.W; ++ w)
            {
                std::cout << field[h][w];
            }   std::cout << '\n';
        }       std::cout << '\n';
    }
    */
};
